<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d928e2ef516a8dae84325348c027a30687a599c692c89fd21b73e7e7f7fe2951","plan_job_ref":"Job PR Plan #15 at https://github.com/tyng94/tyng94/actions/runs/6987405455","plan_hash":"2b711abc079d01b35a949d4421742cbd5abde9036c3a265f872830db878d1af9","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in ___infrastructure__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "*********************"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default_vpc_security_group_id = (known after apply)
```
</details>

:memo: Plan generated in [PR Plan #15](https://github.com/tyng94/tyng94/actions/runs/6987405455)